In [1]:
import pandas as pd

In [2]:
salaries_csv = pd.read_csv('datascience_salaries.csv')
df = pd.DataFrame(salaries_csv)
print(df.head())

   Unnamed: 0       job_title   job_type experience_level       location  \
0           0  Data scientist  Full Time           Senior  New York City
1           2  Data scientist  Full Time           Senior         Boston
2           3  Data scientist  Full Time           Senior         London
3           4  Data scientist  Full Time           Senior         Boston
4           5  Data scientist  Full Time           Senior  New York City

  salary_currency  salary
0             USD  149000
1             USD  120000
2             USD   68000
3             USD  120000
4             USD  149000

In [4]:
from sklearn.preprocessing import MinMaxScaler

scaler = MinMaxScaler()
df['Salary_normalized'] = scaler.fit_transform(df[['salary']])

In [5]:
print(df.head())

   Unnamed: 0       job_title   job_type experience_level       location  \
0           0  Data scientist  Full Time           Senior  New York City
1           2  Data scientist  Full Time           Senior         Boston
2           3  Data scientist  Full Time           Senior         London
3           4  Data scientist  Full Time           Senior         Boston
4           5  Data scientist  Full Time           Senior  New York City

  salary_currency  salary  Salary_normalized
0             USD  149000           0.601010
1             USD  120000           0.454545
2             USD   68000           0.191919
3             USD  120000           0.454545
4             USD  149000           0.601010

In [12]:
from sklearn.decomposition import PCA

numerical_columns = df.select_dtypes(include=["int64", "float64"])
#print(numerical_columns)
pca = PCA(n_components=2)
data_transformed = pca.fit_transform(numerical_columns)

#print(data_transformed)

df["PC1"] = data_transformed[:, 0]
df["PC2"] = data_transformed[:, 1]

'\n#This line creates an instance of the PCA class with the parameter n_components set to 2. It specifies that we want to reduce the dimensionality of the data to 2 principal components. In other words, the data will be projected into a 2D space.\n\nreduced_data = pca.fit_transform(df)\nprint(reduced_data)\n'

In [13]:
df.head()

,Unnamed: 0,job_title,job_type,experience_level,location,salary_currency,salary,Salary_normalized,PC1,PC2
0,0,Data scientist,Full Time,Senior,New York City,USD,149000,0.601010,84163.766081,-949.193183
1,2,Data scientist,Full Time,Senior,Boston,USD,120000,0.454545,55163.767131,-941.138351
2,3,Data scientist,Full Time,Senior,London,USD,68000,0.191919,3163.768472,-929.281412
3,4,Data scientist,Full Time,Senior,Boston,USD,120000,0.454545,55163.767548,-939.138352
4,5,Data scientist,Full Time,Senior,New York City,USD,149000,0.601010,84163.767125,-944.193183

In [17]:
grouped_data = df.groupby('job_title')

average_salaries = grouped_data['salary'].mean()
median_salaries = grouped_data['salary'].median()

print("Average salaries by experience level:")
print(average_salaries)

print("\nMedian salaries by experience level:")
print(median_salaries)

Average salaries by experience level:
job_title
Big data            57514.851485
Data analyst        60812.500000
Data scientist      67065.989848
ML Ops              81263.157895
Machine learning    68397.923875
Name: salary, dtype: float64

Median salaries by experience level:
job_title
Big data            56000.0
Data analyst        63000.0
Data scientist      68000.0
ML Ops              62000.0
Machine learning    51000.0
Name: salary, dtype: float64